/******************************************************************************
* 이 소스는 ㈜비씨카드 소유입니다.
* 이 소스를 무단으로 도용하면 법에 따라 처벌을 받을 수 있습니다.
* 작성 : 2007.01.04[skyking@kcp.co.kr]
* 내용 : 메시지 핸들링
******************************************************************************/
package com.bccard.golf.msg;

/******************************************************************************
* 메시지 커스텀 태그.
* @author 조용국
* @version 2007.01.04
******************************************************************************/
public interface MsgHandler {
	/**
	 * @param getMsgEtt
	 * @return MsgEtt
	 */
	public MsgEtt getMsgEtt();
}
