/******************************************************************************
* 이 소스는 ㈜비씨카드 소유입니다.
* 이 소스를 무단으로 도용하면 법에 따라 처벌을 받을 수 있습니다.
* 작성 :  2004.08.02 [조용국(ykcho@e4net.net)]
* 내용 : DbTao 처리를 위한 각종 상수
* 적용범위  : welco
* 작성일자  : 2007.01.04
******************************************************************************/
package com.bccard.golf.dbtao;
 
/** ****************************************************************************
 * DbTao 처리를 위한 슈퍼 클래스.
 * @author  조용국
 * @version 2007.01.04
 **************************************************************************** */
public class DbTaoConst {
	public static final String EMPTY = "";
	public static final String LF    = "\n";
	public static final String TAB   = "\t";
}
 