/**********************************************************************************************************************
*   클래스명  : ChkDupAccountEtt
*   작성자    : 백이선 (ThisLine)
*   내용      : 사용자 로그인 조건 Entity
*   적용범위  : BC 기업카드 인터넷서비스 시스템
*   작성일자  : 2003.09.25
************************** 수정이력 ***********************************************************************************
*    일자      버전   작성자   변경사항
*
**********************************************************************************************************************/
package com.bccard.golf.dbtao.proc.login;

import com.bccard.waf.core.AbstractEntity;

/******************************************************************************
 * User ChkDupAccount Condition Entity
 * @version   2003.09.17
 * @chkDupAccountor    <A href="mailto:thisline@e4net.net">yiseon baek</A>
 *****************************************************************************/

/******************************************************************************
* Golf : ChkDupAccountEtt
* @author	(주)미디어포스
* @version	1.0
******************************************************************************/


 

public class ChkDupAccountEtt extends AbstractEntity{
	private String account;
	

/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @param account String객체.
* @return  void 
********************************************************************************** */ 
	public void setAccount(String account){ this.account = account; }


/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @return  String 
********************************************************************************** */ 
	public String getAccount(){ return this.account; }
}
