/**********************************************************************************************************************
*   클래스명  : JoinConEtt
*   작성자    : csj007
*   내용      : 사용자 로그인 조건 Entity
*   적용범위  :etax
*   작성일자  : 2008.07.17
************************** 수정이력 ***********************************************************************************
*    일자      버전   작성자   변경사항
*
**********************************************************************************************************************/
package com.bccard.golf.common;

import com.bccard.waf.core.AbstractEntity;


/** ***************************************
* renewal 
* @version 2005 12 12 
* @author 김연길
********************************************** */

public class JoinConEtt extends AbstractEntity{
	

	//이하 회원정보등록 입력필드
	
	private String jumin_no;		//주민등록번호
	private String memNm;			//한글성명
	private String join_date;		//가입일자
	private String mgr_id;			//관리자ID
	private String login_passwd;		//로그인비밀번호
	private String mgr_clss;		//관리자구분(01:비씨관리자, 02:회원은행관리자, 03:지방세 관리자 04:국세 관리자)
	private String usr_blon_code;		//사용자소속코드(지차체관리자:기관코드, 회원은행관리자:영업정번호)
	private String usr_part_nm;		//사용자소속명
	private String last_conn_date;		//최근접속일자
	private String last_conn_time;		//최근접속시간
	
	//이상 회원정보등록 입력필드
	private String pwdChangeYN; //패스워드 변경 유무
	
	private String gr_corp_no;
	private String hdqt_no;
	private String mb_cdhd_no;
	private String bef_card_no;
	private String cert_req_no;
	private String inp_mem_id;
	private String inp_date;
	private String logo_disp_yn;

	private byte[] h_passwd;			
	private byte[] e_passwd;	
    private String uc_mem_id;
    private String mem_id;
    private String seq_no;
	private String rep_id_clss;
	private String last_data_yn;
	private String mem_stat;
	private String entp_info_clss;
	private String site_clss;
	private String member_clss;
	
	/**
	 * 
	 */
	

/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @return  
********************************************************************************** */ 
	public JoinConEtt(){
		/*
		this.last_data_yn = "Y";
		this.mem_stat = "2";

		this.site_clss = "1";//ucusrinfo에 들어갈 사이트구분(1:카드, 2:라인)
		this.member_clss = "5";//ucusrinfo에 들어갈 회원구분(1:개인, 2:가맹점, 3:기업(구), 4:미소지회원, 5:기업)
		*/
	}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getBef_card_no() {
	return bef_card_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setBef_card_no(String bef_card_no) {
	this.bef_card_no = bef_card_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getCert_req_no() {
	return cert_req_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setCert_req_no(String cert_req_no) {
	this.cert_req_no = cert_req_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public byte[] getE_passwd() {
	return e_passwd;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setE_passwd(byte[] e_passwd) {
	this.e_passwd = e_passwd;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getEntp_info_clss() {
	return entp_info_clss;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setEntp_info_clss(String entp_info_clss) {
	this.entp_info_clss = entp_info_clss;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getGr_corp_no() {
	return gr_corp_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setGr_corp_no(String gr_corp_no) {
	this.gr_corp_no = gr_corp_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public byte[] getH_passwd() {
	return h_passwd;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setH_passwd(byte[] h_passwd) {
	this.h_passwd = h_passwd;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getHdqt_no() {
	return hdqt_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setHdqt_no(String hdqt_no) {
	this.hdqt_no = hdqt_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getMemNm() {
	return memNm;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setMemNm(String memNm) {
	this.memNm = memNm;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getInp_date() {
	return inp_date;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setInp_date(String inp_date) {
	this.inp_date = inp_date;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getInp_mem_id() {
	return inp_mem_id;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setInp_mem_id(String inp_mem_id) {
	this.inp_mem_id = inp_mem_id;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getJoin_date() {
	return join_date;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setJoin_date(String join_date) {
	this.join_date = join_date;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getJumin_no() {
	return jumin_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setJumin_no(String jumin_no) {
	this.jumin_no = jumin_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getLast_conn_date() {
	return last_conn_date;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setLast_conn_date(String last_conn_date) {
	this.last_conn_date = last_conn_date;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getLast_conn_time() {
	return last_conn_time;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setLast_conn_time(String last_conn_time) {
	this.last_conn_time = last_conn_time;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getLast_data_yn() {
	return last_data_yn;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setLast_data_yn(String last_data_yn) {
	this.last_data_yn = last_data_yn;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getLogin_passwd() {
	return login_passwd;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setLogin_passwd(String login_passwd) {
	this.login_passwd = login_passwd;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getLogo_disp_yn() {
	return logo_disp_yn;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setLogo_disp_yn(String logo_disp_yn) {
	this.logo_disp_yn = logo_disp_yn;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getMb_cdhd_no() {
	return mb_cdhd_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setMb_cdhd_no(String mb_cdhd_no) {
	this.mb_cdhd_no = mb_cdhd_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getMem_id() {
	return mem_id;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setMem_id(String mem_id) {
	this.mem_id = mem_id;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getMem_stat() {
	return mem_stat;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setMem_stat(String mem_stat) {
	this.mem_stat = mem_stat;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getMember_clss() {
	return member_clss;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setMember_clss(String member_clss) {
	this.member_clss = member_clss;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getMgr_clss() {
	return mgr_clss;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setMgr_clss(String mgr_clss) {
	this.mgr_clss = mgr_clss;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getMemId() {
	return mgr_id;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setMemId(String mgr_id) {
	this.mgr_id = mgr_id;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getRep_id_clss() {
	return rep_id_clss;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setRep_id_clss(String rep_id_clss) {
	this.rep_id_clss = rep_id_clss;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getSeq_no() {
	return seq_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setSeq_no(String seq_no) {
	this.seq_no = seq_no;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getSite_clss() {
	return site_clss;
}

/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */

public void setSite_clss(String site_clss) {
	this.site_clss = site_clss;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getUc_mem_id() {
	return uc_mem_id;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setUc_mem_id(String uc_mem_id) {
	this.uc_mem_id = uc_mem_id;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getUsr_blon_code() {
	return usr_blon_code;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setUsr_blon_code(String usr_blon_code) {
	this.usr_blon_code = usr_blon_code;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getUsr_part_nm() {
	return usr_part_nm;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setUsr_part_nm(String usr_part_nm) {
	this.usr_part_nm = usr_part_nm;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public String getPwdChangeYN() {
	return pwdChangeYN;
}


/** ****************************************************************************
 * 기관코드 입력.
 * @param inst_code 기관코드
 **************************************************************************** */
public void setPwdChangeYN(String pwdChangeYN) {
	this.pwdChangeYN = pwdChangeYN;
}

}