/** ****************************************************************************
 * 이 소스는 ㈜비씨카드 소유입니다.
 * 이 소스를 무단으로 도용하면 법에 따라 처벌을 받을 수 있습니다.
 * 작성 : csj007
 * 내용 : 지방세 통합 시스템 예외
 ************************** 수정이력 *******************************************
 *    일자      버전   작성자   변경사항
 *
 **************************************************************************** */
package com.bccard.golf.common;

import com.bccard.waf.core.AbstractEntity;

/** ****************************************************************************
 * 조직도 정보를 담을 Entity.
 **************************************************************************** */


public class MakeFileResEtt extends AbstractEntity {
	private String	err_msg;		// 에러 메세지
	private String  file_name;		// 파일 이름
	private String  file_type;		// 파일 종류
	private String  file_size;		// 파일 크기
	private String  js_str;			// 생성 자바스크립트


/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @return  public 
********************************************************************************** */ 
    public MakeFileResEtt() {
		this.err_msg		= "";
		this.file_name		= "";
		this.file_type		= "";
		this.file_size		= "";
		this.js_str			= "";
    }


/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @param err_msg String객체.
* @return  void 
********************************************************************************** */ 
    public void setErr_msg(String err_msg)		{ this.err_msg		= err_msg; }

/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @param file_name String객체.
* @return  void 
********************************************************************************** */ 
    public void setFile_name(String file_name)	{ this.file_name	= file_name; }

/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @param file_type String객체.
* @return  void 
********************************************************************************** */ 
    public void setFile_type(String file_type)	{ this.file_type	= file_type; }

/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @param file_size String객체.
* @return  void 
********************************************************************************** */ 
    public void setFile_size(String file_size)	{ this.file_size	= file_size; }

/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @param js_str String객체.
* @return  void 
********************************************************************************** */ 
    public void setJs_str(String js_str)		{ this.js_str		= js_str; }


/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @return  String 
********************************************************************************** */ 
    public String getErr_msg()		{ return this.err_msg; }

/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @return  String 
********************************************************************************** */ 
    public String getFile_name()	{ return this.file_name; }

/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @return  String 
********************************************************************************** */ 
    public String getFile_type()	{ return this.file_type; }

/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @return  String 
********************************************************************************** */ 
    public String getFile_size()	{ return this.file_size; }

/** ******************************************************************************** 
* 기업
* @version 2005 12 12 
* @author 김연길
* @return  String 
********************************************************************************** */ 
    public String getJs_str()		{ return this.js_str; }

}

